#!/bin/sh

# ==============================================================================
# cabletv2m3u 配置
# ==============================================================================

# 可选的设备配置文件。建议使用：VAR="${VAR:-value}"，这样环境变量优先。
CONFIG_LOCAL_FILE="${PROJECT_DIR:-.}/config.local.sh"
if [ -f "$CONFIG_LOCAL_FILE" ]; then
	. "$CONFIG_LOCAL_FILE"
fi

# ------------------------------------------------------------------------------
# 广电 API
# ------------------------------------------------------------------------------

API_NAVCHECK_URL="${API_NAVCHECK_URL:-http://172.16.241.29:80/u1/NavCheck}"
API_CHANNEL_URL="${API_CHANNEL_URL:-http://172.16.241.29:80/u1/GetGroupChannels}"

API_CLIENT="${API_CLIENT:-1024301261700119478}"
API_DEVICE_ID="${API_DEVICE_ID:-}"

# curl 超时
API_CONNECT_TIMEOUT="${API_CONNECT_TIMEOUT:-5}"
API_TIMEOUT="${API_TIMEOUT:-10}"

# ------------------------------------------------------------------------------
# 运行目录
# ------------------------------------------------------------------------------

# OpenWrt /tmp 通常使用 tmpfs，适合存放运行时数据。
RUNTIME_DIR="${RUNTIME_DIR:-/tmp/cabletv2m3u}"

# ------------------------------------------------------------------------------
# API 数据
# ------------------------------------------------------------------------------

NAVCHECK_FILE="$RUNTIME_DIR/navcheck.json"
CHANNEL_FILE="$RUNTIME_DIR/channels.json"
CHANNEL_DATA_FILE="$RUNTIME_DIR/channels.ndjson"

# ------------------------------------------------------------------------------
# 输出文件
# ------------------------------------------------------------------------------

# 正式输出文件。
M3U_FILE="$RUNTIME_DIR/iptv.m3u"
EPG_FILE="$RUNTIME_DIR/epg.xml"

# 临时输出文件。
# 生成完成后使用 mv 原子替换正式文件。
M3U_TEMP_FILE="$RUNTIME_DIR/iptv.m3u.tmp"
EPG_TEMP_FILE="$RUNTIME_DIR/epg.xml.tmp"

# ------------------------------------------------------------------------------
# Web
# ------------------------------------------------------------------------------

# Web 服务通过软链接访问 /tmp 中的文件。
WEB_DIR="${WEB_DIR:-/www}"

# ------------------------------------------------------------------------------
# M3U
# ------------------------------------------------------------------------------

# 暂时没有 XMLTV，所以为空。
# 后续实现 EPG 后再设置。
EPG_URL="${EPG_URL:-}"